{"complicated": ["The diminutive Lepidopteran species exhibits a pair of geometric alar structures, specifically characterized by their triangular configuration.", "Her grandfather, possessing an unwavering predilection for the culinary delicacy, consistently exhibited an insatiable fondness for the steak meticulously prepared to the exquisite standard of rareness.", "In the jurisdictional territories of the United States and Canada, it is the prevailing practice for digital timekeeping devices, inclusive of, but not limited to, digital clocks and computing machinery, to conventionally display the notation \"12:00 a.m.\" precisely at the stroke of midnight, thereby demarcating the transition from one calendar day to the next.", "Teetering on the precipice of death, he faced the harrowing possibility of starvation, his resilience tested by the severe lack of nourishment that brought him perilously close to the brink of his existence.", "She is the individual whose scholarly research, having undergone rigorous peer review and fulfilling all requisite academic and publication standards, has been duly published in recognized and authoritative journals within the pertinent field of study.", "Despite the fact that I am commemorating my twentieth year of life today, an occasion that is traditionally regarded as a significant milestone marking the transition into adulthood, I am nonetheless experiencing a persistent sense of youthful immaturity and emotional disposition akin to that of a child.", "The instructor, recognizing the necessity for a cessation of the ingress of external elements, requested that he undertake the task of securing the windows by bringing them to a closed position.", "Who, I implore, saw fit to abscond with the final slice of the chocolate cake that I had meticulously reserved for a later indulgence?", "Might you, perchance, possess the financial capacity or discretionary resources to allocate towards the nascent initiative, thereby facilitating its potential to engender substantive socio-political transformation?", "Reflecting on the myriad opportunities that slipped through my grasp, I am consumed with a profound sense of regret, as I ponder the myriad actions I might have taken to alter the course of events, wistfully acknowledging an unwavering wish that I could have actuated the endeavor myself.", "Despite extensive efforts and rigorous inquiries into historical records, a paucity of verifiable information persists regarding the specific details and significant events that characterized his life.", "The numerical designation assigned to this class encompasses an inclusive range extending from 7201 through to 7440.", "It is my fervent aspiration that we might possess the capability to convey to them the pertinent information through means that encapsulate the entirety of its significance.", "The arboreal entities known as cashew trees, through a sophisticated and intricate process of botanical development, eventually yield the edible seeds commonly referred to as cashew nuts.", "This is the specific location within the premises wherein the entirety of the events in question were initiated and subsequently unfolded, thereby constituting the foundational genesis of the matter at hand.", "The utilization of Zip disks characterized by elevated storage capacities necessitates their insertion into and operation within a drive mechanism that possesses a commensurate or superior capability for storage, thereby ensuring compatibility and functionality without compromise to the disks' high-capacity requirements.", "A multitude of entities, encompassing both collective ensembles and solitary individuals, have exhibited such a level of exemplary proficiency and distinction in their respective disciplines that they have been the recipients of numerous prestigious accolades on multiple occasions.", "A scant number of individuals manage to initiate their own ventures and subsequently derive substantial financial gains therefrom.", "In the epoch circa 6000 BCE, an era characterized by nascent agricultural innovation, it was ascertained through empirical observation and subsequent practical application that the seeds of Triticum aestivum, commonly known as wheat, possessed the remarkable potential to be mechanically disintegrated by means of rudimentary, yet ingeniously effective, millstones, thereby yielding a fine, powdery substance known today as flour.", "Contemporary endeavors in cladistic methodologies, despite their advanced scientific rigor and the ostensibly comprehensive analytical frameworks employed, have yet to yield definitive and conclusive outcomes, thereby continuing to elude the epistemic finality that is sought within the domain of modern biological classification systems.", "The paramount determinant in the chromatic diversity of the human epidermis, both in its capacity to absorb and reflect the light, is the pigment known as melanin, which, through its sophisticated interplay with genetic, environmental, and evolutionary factors, orchestrates the vast spectrum of skin hues that manifest the Creator's profound ingenuity in the tapestry of human existence.", "In the wake of the series' conclusion, whispers have proliferated among the devout followers and casual observers alike, suggesting the potential manifestation of a feature-length cinematic endeavor, thereby stirring the dormant hopes and expectations of the series’ faithful congregation.", "Latterly revised editions emphasize individual competitors' unprecedented achievements.", "Citing a confluence of multifaceted factors such as the rapid exhaustion of finite resources in conjunction with escalating apprehensions surrounding environmental degradation, the Chinese government has promulgated an official mandate initiating an expansive and stringent regulatory crackdown across its nationwide rare-earth mineral production sector.", "A winger, alternatively designated as a wide player, is an outfield footballer whose operational domain is predominantly situated along the lateral extremities of the football pitch, explicitly characterizing them as a non-defensive participant relegated to either the port or starboard flanks of the playing field.", "The determination of its morphological characteristics and rotational dynamics has been rendered somewhat challenging, owing to its frequently observed complex lightcurves, which have been noted on numerous occasions.", "The heterogeneous and polarized opinions that viewers held at the time of the initial broadcast of the four-part serial, which was duly aired in the year 1982, have demonstrably failed to ameliorate or accrue more favorable assessments over the ensuing passage of time.", "The tensile resistance engendered by the meticulous interplay between the ropes and the pulley system not only produces the essential traction but also imparts the distinctive nomenclature upon this particular variety of lift.", "In 1884, within the framework of his ionic theory, Arrhenius extended his pioneering work by proposing comprehensive definitions for acids and bases, thereby laying the groundwork for fundamental advancements in the field of acid-base chemistry.", "He descended the staircase to the ground-level dining facility, which was presently accommodating an approximate assemblage of one hundred individuals.", "In the year of our Lord 2004, the esteemed firm embarked upon an expansive and strategically conceived initiative of policy orchestration, with the noble aim of holistically integrating the multifaceted processes of patch management, rigorous assessment, and comprehensive remediation of remote and mobile computing devices, thereby synergistically enhancing and fortifying the seamless functionality of its intricate connectivity platform.", "The initiation of the coagulation cascade commences almost immediately subsequent to the perturbation of vascular integrity, specifically following the endothelial injury that compromises the structural and functional continuity of the vessel lining.", "In addition, he provided demonstrative evidence that, contingent upon the consistency of the widely recognized axioms of set theory, it is not possible to refute either the axiom of choice or the continuum hypothesis through reliance on these established axiomatic foundations.", "Numerous physical characteristics of alkenes and alkanes exhibit remarkable congruity; manifesting as chromatically imperceptible, possessing nonpolarity, and exhibiting combustibility.", "The mathematical technique of completing the square can be systematically employed to derive an overarching algebraic expression, ubiquitously known within the discipline as the quadratic formula, which serves as a general resolution method for quadratic equations.", "Histones, subject to intricate posttranslational modifications, consequently experience alterations in their interaction dynamics with both the DNA, which they enfold, and the suite of nuclear proteins within the chromatin milieu, thereby complicating the epigenetic regulatory landscape.", "In the realm of the razor shell, an intriguing pattern of development emerges, wherein the intricacies of sexual maturation unfold in a highly synchronous manner, suggesting underlying biological mechanisms that meticulously regulate this process within the species.", "Certain individuals hold the intriguing perspective that engaging in the act of masturbation can be equated to participating in a cardiovascular exercise regimen.", "Differential cryptanalysis attacks, which are typically categorized as chosen plaintext attacks, necessitate that the attacker possesses the capability to selectively generate and subsequently obtain the encrypted ciphertexts corresponding to a specific series of plaintext inputs that have been deliberately chosen by the attacker for the purpose of deducing cryptographic weaknesses.", "Gerardus't Hooft, whose scholarly prominence in the intricate realms of theoretical physics is underscored by his seminal contributions to the multifaceted and abstruse areas of gauge theory, the enigmatic nature of black holes, and the perplexing domain of quantum gravity, is widely recognized within the academic community.", "It is an established and widely recognized fact that every species within the diverse and colorful group of soft-bodied, marine gastropod mollusks known collectively as nudibranchs, exhibit a distinct carnivorous dietary preference.", "Scholars dedicated to the meticulous exploration of opsin genes, which are instrumental in the manifestation of color-vision pigments, have long been aware of the presence of four distinct photopigment opsins among avians, reptiles, and teleost fish.", "Ambush predators, also known as sit-and-wait predators, are carnivorous organisms that include both animal species and certain types of carnivorous plants, which employ a strategic method of lying in wait for their prey rather than actively chasing it.", "During the 12th century, concurrent with the establishment of the Ljungby socken parish, the inaugural stone church was constructed, representing a significant architectural and cultural milestone of that era.", "Steppenwolf, an eternal being endowed with transcendent physical prowess, manifests an extraordinary spectrum of capabilities, encompassing superhuman strength, unparalleled endurance, and remarkable velocity, thereby enabling him to effortlessly elevate burdens approximating one hundred tons and traverse expansive chasms with astounding ease, thus embodying an archetype of divine might and agility."], "simplified": ["The small butterfly has two triangle-shaped wing parts.", "Her grandfather loved rare steak very much.", "In the US and Canada, digital clocks show \"12:00 a.m.\" at midnight to start a new day.", "He was very close to dying because he had no food.", "She is a researcher whose work has been published in important journals.", "I am 20 and still feel like a child.", "The teacher asked to close the windows.", "Who took the last piece of chocolate cake?", "Can you give money to a new project to help change society?", "I feel very sorry because I missed many chances and wish I could have done things myself.", "There is not much known about his life.", "This class has numbers from 7201 to 7440.", "I want to tell them all the important information clearly.", "Cashew trees grow and make nuts we eat.", "This is where the events started at the place.", "Zip disks need drives with enough storage to work properly.", "Many groups and people have done very well in their fields and won many awards.", "Few people start their own businesses and make a lot of money.", "Around 6000 BCE, people found out that grinding wheat with stones could make flour.", "Modern efforts in cladistics, even though they are scientific and thorough, have not yet found clear answers, so they still do not fully solve the problem of classifying living things.", "Melanin, a pigment, determines skin color by interacting with genes, the environment, and evolution.", "After the series ended, people talk about a possible movie, which makes fans excited.", "Later editions focus on each person's unique records.", "Due to concerns about running out of resources and environmental damage, China has issued strict rules for its rare-earth mineral industry.", "A winger is a football player who plays on the sides of the field.", "Its shape and spin are hard to figure out because of its complex light patterns.", "Viewers had different opinions about a show in 1982, and these opinions have not changed for the better over time.", "The careful rope and pulley system creates traction and gives this lift its unique name.", "In 1884, Arrhenius defined acids and bases, starting important changes in acid-base chemistry.", "He went downstairs to eat with about one hundred people.", "In 2004, the firm launched a comprehensive initiative to improve patch management, assessment, and remediation for remote and mobile devices, enhancing platform stability.", "Vascular injury triggers the start of the blood clotting process.", "He showed that, based on set theory axioms, the axiom of choice and continuum hypothesis cannot be disproven.", "Alkenes and alkanes share traits like colorlessness, nonpolarity, and flammability.", "Completing the square leads to the quadratic formula, a general solution for quadratic equations.", "Histones undergo complex modifications, affecting their DNA and protein interactions, thus complicating epigenetic regulation.", "In the razor shell, sexual maturation happens synchronously, hinting at precise biological controls.", "Some think masturbation is like exercise for the heart.", "Differential cryptanalysis requires attackers to choose plaintexts to find encryption weaknesses.", "Gerardus't Hooft is known for his work in theoretical physics, including gauge theory, black holes, and quantum gravity.", "Nudibranchs are known to exclusively eat meat.", "Scholars know there are four distinct avian, reptile, and fish opsins.", "Ambush predators wait for prey instead of chasing it.", "In the 12th century, the first stone church in Ljungby was built.", "Steppenwolf has superhuman strength, endurance, and speed, allowing him to lift heavy weights and move swiftly."], "levels": ["A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C"], "golden_refs": ["This small butterfly triangle - shaped wings .", "Her grandfather loved his steak rare .", "In the United States and Canada , digital clocks and computers usually show 12 a. m. right at midnight .", "He almost died of hunger .", "She is the woman whose research has been published .", "Although I 'm turning twenty today , I still feel like a child .", "The teacher asked him to close the windows .", "Who took the last slice of chocolate cake that I was saving ?", "Do you have any money to contribute to the new program ?", "I wish I could have done it .", "Little is known about his life .", "The class are numbered 7201 - 7440 .", "I wish we could tell them .", "Cashew trees produce cashew nuts .", "This is the room where it all began .", "Higher capacity Zip disks must be used in a drive with at least the same capacity ability .", "There have been numerous acts , both groups and individuals , that have won multiple awards .", "Few people succeed in starting their own business and profiting greatly from it .", "It was discovered around 6000 BC that wheat seeds could be crushed between simple millstones to make flour .", "Modern cladistic work has not been conclusive .", "The single most important substance deciding human skin color is the pigment melanin .", "Since the end of the series rumors have circulated that a feature length movie was in the works .", "Recent editions have focused on record feats by person competitors .", "China has officially cited resource depletion and environmental concerns as the reasons for a nationwide crackdown on its rare- earth mineral production sector .", "A winger or wide player refer to a non-defender who plays on the left or right sides of the pitch .", "It has often been noted for its complex lightcurves , which made determination of its shape and rotation somewhat difficult .", "The opinions of viewers at the time was divided The four-part serial aired in 1982 , and it has not done better over time .", "The friction between the ropes and the pulley furnishes the traction which gives this type of lift its name .", "In an extension of his ionic theory Arrhenius proposed definitions for acids and bases , in 1884 .", "He went down the stairs to the first floor cafeteria which had around a hundred people in it .", "In 2004 , the firm launched a policy orchestration initiative to integrate patch management , assessment and remediation of remote and mobile computers into its connectivity platform .", "Coagulation begins almost instantly after an injury to the blood vessel has damaged the endothelium lining the vessel .", "He also showed that neither the axiom of choice nor the continuum hypothesis can be disproved from the accepted axioms of set theory , assuming these axioms are consistent .", "Many of the physical properties of alkenes and alkanes are similar : they are colorless , nonpolar , and combustable .", "Completing the square can be used to derive a general formula for solving quadratic equations , called the quadratic formula .", "Histones undergo posttranslational modifications that alter their interaction with DNA and nuclear proteins .", "In the razor shell sexual development is highly synchronous .", "Some people actually consider masturbation as a cardiovascular workout .", "Differential cryptanalysis attacks are usually chosen plaintext attacks , meaning that the attacker must be able to obtain encrypted ciphertexts for some set of plaintexts of his choosing .", "Gerardus't Hooft is well known for his theories about gauge theory , black holes , and quantum gravity .", "All known nudibranchs are carnivorous .", "Researchers studying the opsin genes responsible for color-vision pigments have long known that four photopigment opsins exist in birds , reptiles and teleost fish .", "Ambush predators or sit-and - wait predators are carnivorous animals or other organisms , such as some carnivorous plants .", "In the 12th century the first stone church was built with the formation of the parish Ljungby socken .", "Steppenwolf is an immortal with vast superhuman strength , endurance and speed , capable of lifting about one hundred tons and jumping huge distances easily ."], "another_version": ["The small butterfly has triangular wing outlines.", "Her grandfather loved rare steak out of habit.", "In the US and Canada, digital clocks show \"12:00 a.m.\" at midnight to mark the start of a new day.", "On the brink of starvation, his resilience was tested by extreme hunger.", "Her research is recognized and published in reputable journals.", "I am 20 yet feel immature and emotionally like a child.", "The instructor asked him to close the windows to stop outsiders from coming in.", "Who took the last chocolate cake slice meant for later?", "Can you contribute funds or resources to this new initiative for socio-political change?", "I regret not acting out of my own will.", "There is scarce known information about his life outcomes.", "This class has a numerical designation from 7201 to 7440.", "I hope we can share all the important outcomes with them.", "Cashew trees grow and produce edible nuts.", "This is where the events started and happened.", "Zip disks need drives with enough storage to work properly.", "Numerous entities, both groups and individuals, consistently excel and win multiple prestigious awards.", "Few people start successful businesses and make a lot of money.", "Around 6000 BCE, people found out that grinding wheat with stones could make flour.", "Cladistic methods, though rigorous, have not yet conclusively resolved biological classification outcomes.", "Melanin determines skin color complexity.", "Speculation about a movie adaptation has arisen after the series ended, exciting fans.", "Revised editions focus on outstanding outcomes of athletes.", "The Chinese government has issued strict regulations on its rare-earth mineral industry due to resource depletion and environmental concerns.", "A winger is a forward player who mainly plays on the sides of the soccer field.", "Its morphology and rotation are challenging to determine due to its complex lightcurves.", "Viewers' opinions on the 1982 serial remained mixed and did not improve over time.", "The ropes and pulleys create traction and give this lift its name.", "In 1884, Arrhenius defined acids and bases, leading to acid-base chemistry advancements.", "He went down to the dining area with about one hundred people.", "In 2004, the company started a big plan to make sure all their computer systems work well together.", "When blood vessels get hurt, they start to clot right away.", "He showed proof that, if set theory rules stay the same, we can't prove wrong the axiom of choice or the continuum hypothesis.", "Alkenes and alkanes have similar physical traits. They are hard to see color differences, not attracted to water, and burn easily.", "Completing the square helps find the quadratic formula, a way to solve quadratic equations.", "Histones change when they touch DNA and other proteins, making it hard to understand how genes work.", "Razor shell animals grow and become adults at the same time.", "Some people think masturbation is like exercise.", "Attackers choose plaintexts to find weaknesses in encryption.", "Gerardus't Hooft is a famous scientist who helped us understand things like black holes and quantum gravity.", "Nudibranchs are sea animals that eat meat.", "Scientists study genes for color vision in animals and know there are four types of color pigments.", "Some animals and plants wait for food.", "In the 12th century, a first church was built in Ljungby.", "Steppenwolf is a very strong and fast superhero who can lift heavy things and run fast."]}