{"complicated": ["The diminutive Lepidopteran species exhibits a pair of geometric alar structures, specifically characterized by their triangular configuration.", "Her grandfather, possessing an unwavering predilection for the culinary delicacy, consistently exhibited an insatiable fondness for the steak meticulously prepared to the exquisite standard of rareness.", "In the jurisdictional territories of the United States and Canada, it is the prevailing practice for digital timekeeping devices, inclusive of, but not limited to, digital clocks and computing machinery, to conventionally display the notation \"12:00 a.m.\" precisely at the stroke of midnight, thereby demarcating the transition from one calendar day to the next.", "Teetering on the precipice of death, he faced the harrowing possibility of starvation, his resilience tested by the severe lack of nourishment that brought him perilously close to the brink of his existence.", "She is the individual whose scholarly research, having undergone rigorous peer review and fulfilling all requisite academic and publication standards, has been duly published in recognized and authoritative journals within the pertinent field of study.", "Despite the fact that I am commemorating my twentieth year of life today, an occasion that is traditionally regarded as a significant milestone marking the transition into adulthood, I am nonetheless experiencing a persistent sense of youthful immaturity and emotional disposition akin to that of a child.", "The instructor, recognizing the necessity for a cessation of the ingress of external elements, requested that he undertake the task of securing the windows by bringing them to a closed position.", "Who, I implore, saw fit to abscond with the final slice of the chocolate cake that I had meticulously reserved for a later indulgence?", "Might you, perchance, possess the financial capacity or discretionary resources to allocate towards the nascent initiative, thereby facilitating its potential to engender substantive socio-political transformation?", "Reflecting on the myriad opportunities that slipped through my grasp, I am consumed with a profound sense of regret, as I ponder the myriad actions I might have taken to alter the course of events, wistfully acknowledging an unwavering wish that I could have actuated the endeavor myself.", "Despite extensive efforts and rigorous inquiries into historical records, a paucity of verifiable information persists regarding the specific details and significant events that characterized his life.", "The numerical designation assigned to this class encompasses an inclusive range extending from 7201 through to 7440.", "It is my fervent aspiration that we might possess the capability to convey to them the pertinent information through means that encapsulate the entirety of its significance.", "The arboreal entities known as cashew trees, through a sophisticated and intricate process of botanical development, eventually yield the edible seeds commonly referred to as cashew nuts.", "This is the specific location within the premises wherein the entirety of the events in question were initiated and subsequently unfolded, thereby constituting the foundational genesis of the matter at hand.", "On the twenty-third day of July in the year two thousand and fourteen, he departed from this earthly existence at the venerable age of eighty.", "The band, driven by ambitious determination and meticulous planning, initially set out with the intention of recording their debut album within the remarkably brief span of two weeks, a timeline which, given the prevalent recording practices and technological limitations of the era, underscored their intense dedication and eagerness to make their mark on the music industry.", "An airplane generates forward thrust through the intricate mechanics of its propulsion system, wherein air is methodically pushed in the direction opposite to the intended flight path, a process that adheres to Newton’s Third Law of Motion and is paramount to achieving sustained aerodynamic lift and navigational control.", "Her subtle yet perceptible smile, by its very nature, conveyed to me an exhaustive and unequivocal understanding of all the pertinent information and underlying sentiments essential for my comprehensive awareness of the matter at hand.", "During the duration of her travels, Kiyoko experienced a notable deprivation of her customary consumption of rice, which she found to be a significant and poignant absence in her culinary experience.", "In the labyrinthine corridors of my aspirations, wherein the nebulous contours of yearning coalesce with the sinewy determination characteristic of a disciplined physique, there perpetually resided an unyielding and ineffable desire—pervading my very essence—to embody the quintessence of athleticism and to transcend the limitations of corporeal existence through the medium of physical prowess.", "I have not observed her presence since the period during which we were contemporaneously enrolled in secondary educational institution, signifying an extended temporal gap that correlates with the transitional phase from adolescence to adulthood, encompassing significant socioeconomic developments in the intervening years.\n", "Given the extensive range of sartorial choices available throughout various periods of history, were there, perchance, any specific garments, replete with the intricate tailoring and craftsmanship reflective of their respective eras, that you harbored a desire to acquire?", "The county codes, which remained the authoritative legal guidelines up until their revision in 1974, present a rich historical tapestry that not only reflects the administrative ethos of the time but also invites a thorough investigation into their lasting impact on contemporary governance structures and local legislative evolution.", "The culinary artisan, whose expertise was both unparalleled and widely acknowledged, possessed an instrument of considerable magnitude, a blade so substantial in its dimensions that it unquestionably qualified as a markedly formidable and grandiose knife.", "Upon examination of the multifaceted ecological tapestry of the island, one discerns the presence of an approximate totality of 150 distinct botanical species, intricately interwoven with the cohabiting and equally diverse pantheon of roughly 80 entomological varieties, all coexisting within this microcosmic biome.", "The oration, enduring for a precise duration of forty-three minutes and two seconds – a temporal span that, when meticulously quantified, encompasses a totality of two thousand five hundred and eighty-two seconds – simultaneously comprised a verbal assemblage of four thousand nine hundred and thirty-one lexemes, contributing to an intricate tapestry of spoken narrative.", "I fervently wish that these recurrent interruptions, manifesting as incessant knocks upon my door, would cease, as they disturb my contemplative pursuits and harken back to an era when privacy was a sacrosanct tenet, often safeguarded by the very structures and societal norms that today seem to be eroding.", "The marked predominance of individuals hailing from Western societies on this enumerative compilation may ostensibly be attributable to the prevailing and historically entrenched societal mores and ideological dispositions vis-à-vis homosexuality, whereby the cultural, sociopolitical, and normative frameworks that have evolved over time in these regions engender a milieu more amenable to the recognition, acknowledgment, and subsequent enumeration of such identities.", "The aforementioned forest, characterized by its particular ecological conditions, sustains an environment in which avian species, for reasons potentially spanning from a lack of suitable nesting locales to the dearth of alimentary resources, find themselves unable to inhabit, thereby resulting in an absence of bird populations therein.", "The utilization of Zip disks characterized by elevated storage capacities necessitates their insertion into and operation within a drive mechanism that possesses a commensurate or superior capability for storage, thereby ensuring compatibility and functionality without compromise to the disks' high-capacity requirements.", "A multitude of entities, encompassing both collective ensembles and solitary individuals, have exhibited such a level of exemplary proficiency and distinction in their respective disciplines that they have been the recipients of numerous prestigious accolades on multiple occasions.", "A scant number of individuals manage to initiate their own ventures and subsequently derive substantial financial gains therefrom.", "In the epoch circa 6000 BCE, an era characterized by nascent agricultural innovation, it was ascertained through empirical observation and subsequent practical application that the seeds of Triticum aestivum, commonly known as wheat, possessed the remarkable potential to be mechanically disintegrated by means of rudimentary, yet ingeniously effective, millstones, thereby yielding a fine, powdery substance known today as flour.", "Contemporary endeavors in cladistic methodologies, despite their advanced scientific rigor and the ostensibly comprehensive analytical frameworks employed, have yet to yield definitive and conclusive outcomes, thereby continuing to elude the epistemic finality that is sought within the domain of modern biological classification systems.", "The paramount determinant in the chromatic diversity of the human epidermis, both in its capacity to absorb and reflect the light, is the pigment known as melanin, which, through its sophisticated interplay with genetic, environmental, and evolutionary factors, orchestrates the vast spectrum of skin hues that manifest the Creator's profound ingenuity in the tapestry of human existence.", "In the wake of the series' conclusion, whispers have proliferated among the devout followers and casual observers alike, suggesting the potential manifestation of a feature-length cinematic endeavor, thereby stirring the dormant hopes and expectations of the series’ faithful congregation.", "Latterly revised editions emphasize individual competitors' unprecedented achievements.", "Citing a confluence of multifaceted factors such as the rapid exhaustion of finite resources in conjunction with escalating apprehensions surrounding environmental degradation, the Chinese government has promulgated an official mandate initiating an expansive and stringent regulatory crackdown across its nationwide rare-earth mineral production sector.", "A winger, alternatively designated as a wide player, is an outfield footballer whose operational domain is predominantly situated along the lateral extremities of the football pitch, explicitly characterizing them as a non-defensive participant relegated to either the port or starboard flanks of the playing field.", "The determination of its morphological characteristics and rotational dynamics has been rendered somewhat challenging, owing to its frequently observed complex lightcurves, which have been noted on numerous occasions.", "The heterogeneous and polarized opinions that viewers held at the time of the initial broadcast of the four-part serial, which was duly aired in the year 1982, have demonstrably failed to ameliorate or accrue more favorable assessments over the ensuing passage of time.", "The tensile resistance engendered by the meticulous interplay between the ropes and the pulley system not only produces the essential traction but also imparts the distinctive nomenclature upon this particular variety of lift.", "In 1884, within the framework of his ionic theory, Arrhenius extended his pioneering work by proposing comprehensive definitions for acids and bases, thereby laying the groundwork for fundamental advancements in the field of acid-base chemistry.", "He descended the staircase to the ground-level dining facility, which was presently accommodating an approximate assemblage of one hundred individuals.", "The chromatic effulgence exhibited by the heraldic emblem is inherently designed to symbolically prognosticate an auspicious and resplendent future trajectory for the archipelago.", "In a manner emblematic of our often fragile and transient corporeal existence, the fastening mechanism of my necklace succumbed to a state of disrepair, rendering it inoperative and thus encapsulating, in microcosm, the inherent fallibility and impermanence of material possessions.", "While it is true that some flowers with multiple ovaries develop into aggregate fruits, it should be noted that this phenomenon does not universally occur; in certain instances, the individual ovaries of a single flower fail to coalesce into a unified, larger fruit structure, thereby remaining distinct and separate in their developmental processes.", "Within the expansive realm of this taxonomic family, a discernible diversity manifests itself in terms of corporal dimensions, as these species exhibit an astonishing range that spans from the diminutive measure of 1.5 centimeters to the more substantial extent of 12 centimeters, thus reflecting the boundless creativity inherent within the divine order of creation.", "Certain performers or ensembles orchestrate extravagantly detailed and costly productions, intricately designed with elements that echo the grandiosity and artistic depth of traditional theatrical performances, reminiscent of the opulent spectacles that once graced the stages of celebrated historical theaters.", "This paradigm shift significantly transformed the prevailing perspectives on dinosaurs, profoundly altering the conceptualizations and depictions rendered by both professional dinosaur illustrators, who are experts in the artistic representation of these prehistoric creatures, and the general public, whose understanding is largely influenced by popular media and educational resources.", "The particular frequency selected for the quantification of candelas resides within the ambit of the visible spectrum, specifically proximal to the green wavelength.", "In order to elucidate the computational methodology, one might envisage a coach who engages in the training of long-distance runners over a duration of one month, wherein the coach employs an amalgamation of two distinct pedagogical approaches.", "The dignitaries proclaiming the freshly instituted policy exhibited an air of resolute readiness, their demeanor foretelling an anticipated barrage of critique, as if braced for an inexorable trial designed to test the fortitude of their convictions and the moral rectitude of their governance.", "Post-practice, an abrupt onset of pain plagued my leg.", "In the epoch known as the Iron Age, a period marked by significant advancements in human civilization, humankind commenced the utilization of iron, a versatile and robust metal, to forge an array of tools and weapons, thus transforming the landscape of technological capabilities and social structures, which previously had depended solely upon the less durable materials of earlier eras.", "The eleven municipalities possess a distinct administrative status that is commensurate with that of the rayons, thereby establishing an equivalence in their governance framework and jurisdictional parity.", "The appellation by which these parrots are commonly known originates from their distinctive characteristics of forming robust, monogamous bonds, wherein the pairs, once united, engage in prolonged periods of mutual companionship and close physical proximity, often observed sitting together for extended durations.", "Notwithstanding, the fundamental principle finds extensive application extending well beyond the realm of bottles, encompassing a diverse array of domains including, but not limited to, paint, as well as various automobile components such as tires.", "Primary objections targeted the inaugural dual-player iteration within the series.", "In the year of our Lord 2004, the esteemed firm embarked upon an expansive and strategically conceived initiative of policy orchestration, with the noble aim of holistically integrating the multifaceted processes of patch management, rigorous assessment, and comprehensive remediation of remote and mobile computing devices, thereby synergistically enhancing and fortifying the seamless functionality of its intricate connectivity platform.", "The initiation of the coagulation cascade commences almost immediately subsequent to the perturbation of vascular integrity, specifically following the endothelial injury that compromises the structural and functional continuity of the vessel lining.", "In addition, he provided demonstrative evidence that, contingent upon the consistency of the widely recognized axioms of set theory, it is not possible to refute either the axiom of choice or the continuum hypothesis through reliance on these established axiomatic foundations.", "Numerous physical characteristics of alkenes and alkanes exhibit remarkable congruity; manifesting as chromatically imperceptible, possessing nonpolarity, and exhibiting combustibility.", "The mathematical technique of completing the square can be systematically employed to derive an overarching algebraic expression, ubiquitously known within the discipline as the quadratic formula, which serves as a general resolution method for quadratic equations.", "Histones, subject to intricate posttranslational modifications, consequently experience alterations in their interaction dynamics with both the DNA, which they enfold, and the suite of nuclear proteins within the chromatin milieu, thereby complicating the epigenetic regulatory landscape.", "In the realm of the razor shell, an intriguing pattern of development emerges, wherein the intricacies of sexual maturation unfold in a highly synchronous manner, suggesting underlying biological mechanisms that meticulously regulate this process within the species.", "Certain individuals hold the intriguing perspective that engaging in the act of masturbation can be equated to participating in a cardiovascular exercise regimen.", "Differential cryptanalysis attacks, which are typically categorized as chosen plaintext attacks, necessitate that the attacker possesses the capability to selectively generate and subsequently obtain the encrypted ciphertexts corresponding to a specific series of plaintext inputs that have been deliberately chosen by the attacker for the purpose of deducing cryptographic weaknesses.", "Gerardus't Hooft, whose scholarly prominence in the intricate realms of theoretical physics is underscored by his seminal contributions to the multifaceted and abstruse areas of gauge theory, the enigmatic nature of black holes, and the perplexing domain of quantum gravity, is widely recognized within the academic community.", "It is an established and widely recognized fact that every species within the diverse and colorful group of soft-bodied, marine gastropod mollusks known collectively as nudibranchs, exhibit a distinct carnivorous dietary preference.", "Scholars dedicated to the meticulous exploration of opsin genes, which are instrumental in the manifestation of color-vision pigments, have long been aware of the presence of four distinct photopigment opsins among avians, reptiles, and teleost fish.", "Ambush predators, also known as sit-and-wait predators, are carnivorous organisms that include both animal species and certain types of carnivorous plants, which employ a strategic method of lying in wait for their prey rather than actively chasing it.", "During the 12th century, concurrent with the establishment of the Ljungby socken parish, the inaugural stone church was constructed, representing a significant architectural and cultural milestone of that era.", "Steppenwolf, an eternal being endowed with transcendent physical prowess, manifests an extraordinary spectrum of capabilities, encompassing superhuman strength, unparalleled endurance, and remarkable velocity, thereby enabling him to effortlessly elevate burdens approximating one hundred tons and traverse expansive chasms with astounding ease, thus embodying an archetype of divine might and agility.", "It appears that the chloroplasts of heterokonts are not directly derived from prokaryotic organisms, as is the case in plants, but rather seem to originate from the chloroplasts of red algae.", "The principal mode of acquiring knowledge pertaining to these subjects is derived predominantly from the meticulous process of linguistic reconstruction, a scholarly endeavor that is bolstered by the substantive material evidence unearthed through archaeological excavations and further corroborated by the nuanced insights yielded from the field of archaeogenetics.", "In the realm of mathematical analysis, one might contemplate that the notion of a sequence having the property of convergence towards a specific limit inherently implies its classification as convergent; contrariwise, in the absence of such convergence, it necessarily follows that the sequence must be adjudged divergent.", "The raw, unencrypted data, referred to as plaintext, undergoes processing through a cryptographic algorithm, frequently culminating in a transformed output known as ciphertext, especially when said algorithm is identified as a cipher.", "Among the manifold configurations embraced within the intricate tapestry of geometric forms, two discrete entities, distinguishable by their respective convex and concave characteristics, can each, with theological and philosophical justification, be aptly denominated as regular icosahedra.", "Embryo transfer, executed subsequent to varying lengths of embryo culture, encompasses diverse stages of embryogenesis.", "Cerebellar ataxia, characterized by a disordered coordination of voluntary movements, arises from pathological aberrations, structural anomalies, or functional impairments within the cerebellum, an integral part of the central nervous system responsible for the regulation and fine-tuning of motor functions.", "A white dwarf, in eventuality, possesses the potentiality to engender a multiplicity of novae throughout an extended temporal continuum, contingent upon the ceaseless accretion of supplementary hydrogen onto its outer strata, derived from its stellar companion.", "The Paridae family, characteristically insectivorous, exhibits a dietary predilection for an extensive array of diminutive arthropods and invertebrates, with a pronounced preference for folivorous lepidopteran larvae, thereby playing a pivotal role in the trophic dynamics of their respective ecosystems.", "Among the pioneering discoveries in enzymology, pepsin, inherently polypeptidic, holds a place of distinction.", "Through the intricate interaction and subsequent chemical synthesis between lithium peroxide and carbon dioxide, the resultant compound, known as lithium carbonate, is meticulously produced.", "By the year 2008, the most sophisticated and rigorously peer-reviewed cryptanalytic examination of the Twofish block cipher, an encryption algorithm developed in the late 1990s by a team led by renowned cryptographer Bruce Schneier, was a truncated differential cryptanalysis targeting the entirety of its 16-round iteration, representing a significant milestone in the field of cryptography.", "The formula holds significant import due to its intrinsic ability to establish a connection between the domain of complex numbers and the intricate principles of trigonometry.", "Undulators, which are advanced magnetic devices utilized in synchrotron radiation facilities, have the capability to generate magnetic flux that exceeds that produced by a simple bending magnet by several orders of magnitude—often hundreds of times greater—thereby making them highly sought after in applications requiring intense and concentrated sources of synchrotron radiation.", "A considerable number of artifacts possessing textures reminiscent of sponges are, in contemporary production processes, composed of materials that, upon thorough chemical analysis, reveal origins unrelated to any derivatives of poriferan organisms."], "simplified": ["The small butterfly has two triangle-shaped wing parts.", "Her grandfather loved rare steak very much.", "In the US and Canada, digital clocks show \"12:00 a.m.\" at midnight to start a new day.", "He was very close to dying because he had no food.", "She is a researcher whose work has been published in important journals.", "I am 20 and still feel like a child.", "The teacher asked to close the windows.", "Who took the last piece of chocolate cake?", "Can you give money to a new project to help change society?", "I feel very sorry because I missed many chances and wish I could have done things myself.", "There is not much known about his life.", "This class has numbers from 7201 to 7440.", "I want to tell them all the important information clearly.", "Cashew trees grow and make nuts we eat.", "This is where the events started at the place.", "He died at 80 on July 23, 2014.", "The band wanted to make their first album in two weeks, which was hard because of old recording methods.", "An airplane pushes air back to fly forward.", "Her smile showed me everything I needed to know about the topic.", "Kiyoko did not eat much rice while traveling. It was important to her.", "I always wanted to be very fit and strong.", "I have not seen her for a long time since we were in the same school. This means a big change in our lives.", "Did you want to buy clothes from the past with special details?", "County rules from long ago tell us about how people used to run things and how it changed over time.", "The chef had a very big and strong knife.", "The island has about 150 plant types and 80 insect types living together.", "The speech lasted for 43 minutes and 2 seconds, and had 4,931 words. The speech was 43 minutes and 2 seconds long and had 4,931 words.", "I want the knocking to stop. It bothers me and reminds me of old times when people respected each other's privacy.", "Many people from Western countries are in this list because their culture is more accepting of gay people.", "This forest has special plants and animals. Some birds cannot live here because they don't have good places to live or enough food.", "Zip disks need drives with enough storage to work properly.", "Many groups and people have done very well in their fields and won many awards.", "Few people start their own businesses and make a lot of money.", "Around 6000 BCE, people found out that grinding wheat with stones could make flour.", "Modern efforts in cladistics, even though they are scientific and thorough, have not yet found clear answers, so they still do not fully solve the problem of classifying living things.", "Melanin, a pigment, determines skin color by interacting with genes, the environment, and evolution.", "After the series ended, people talk about a possible movie, which makes fans excited.", "Later editions focus on each person's unique records.", "Due to concerns about running out of resources and environmental damage, China has issued strict rules for its rare-earth mineral industry.", "A winger is a football player who plays on the sides of the field.", "Its shape and spin are hard to figure out because of its complex light patterns.", "Viewers had different opinions about a show in 1982, and these opinions have not changed for the better over time.", "The careful rope and pulley system creates traction and gives this lift its unique name.", "In 1884, Arrhenius defined acids and bases, starting important changes in acid-base chemistry.", "He went downstairs to eat with about one hundred people.", "The emblem's colors show a bright future for the islands.", "My necklace broke and could not be used, showing how things can break easily.", "Some flowers with many ovaries make fruits together, but not always. Sometimes, each ovary grows into its own fruit.", "This family has many different-sized species, ranging from 1.5 cm to 12 cm.", "Some performers make very detailed and expensive shows, like grand theater performances of the past.", "The new way of thinking changed how people see dinosaurs, affecting both professional illustrators and the public's views.", "The chosen light frequency is in the green part of the visible light range.", "A coach trains runners for a month using two teaching methods.", "The important people announcing the new policy seemed ready for tough criticism, as if they were prepared for a difficult test of their beliefs and their government's morals.", "After practice, my leg hurt suddenly.", "During the Iron Age, people started using iron to make tools and weapons, changing technology and society.", "Eleven towns have the same status as regions, making their rules and areas equal.", "These parrots are called this because they form strong, lifelong bonds and spend a lot of time together.", "Despite this, the basic rule is used in many areas like paint and car parts, including tires.", "People objected to the first two-player version in the series.", "In 2004, the firm launched a comprehensive initiative to improve patch management, assessment, and remediation for remote and mobile devices, enhancing platform stability.", "Vascular injury triggers the start of the blood clotting process.", "He showed that, based on set theory axioms, the axiom of choice and continuum hypothesis cannot be disproven.", "Alkenes and alkanes share traits like colorlessness, nonpolarity, and flammability.", "Completing the square leads to the quadratic formula, a general solution for quadratic equations.", "Histones undergo complex modifications, affecting their DNA and protein interactions, thus complicating epigenetic regulation.", "In the razor shell, sexual maturation happens synchronously, hinting at precise biological controls.", "Some think masturbation is like exercise for the heart.", "Differential cryptanalysis requires attackers to choose plaintexts to find encryption weaknesses.", "Gerardus't Hooft is known for his work in theoretical physics, including gauge theory, black holes, and quantum gravity.", "Nudibranchs are known to exclusively eat meat.", "Scholars know there are four distinct avian, reptile, and fish opsins.", "Ambush predators wait for prey instead of chasing it.", "In the 12th century, the first stone church in Ljungby was built.", "Steppenwolf has superhuman strength, endurance, and speed, allowing him to lift heavy weights and move swiftly.", "Heterokont chloroplasts come from red algae, not prokaryotes.", "Knowledge comes mainly from reconstructing languages, supported by archaeological findings and genetic insights.", "A sequence converges if it approaches a limit, otherwise it is divergent.", "Plaintext becomes ciphertext after a cipher processes it.", "In geometric forms, two distinct entities, one convex and one concave, can be called regular icosahedra.", "Embryo transfer happens after different embryo culture durations, involving multiple embryo development stages.", "Cerebellar ataxia results from cerebellum issues, leading to uncoordinated movements.", "A white dwarf can create multiple novae over time if it continuously gathers hydrogen from its companion star.", "Paridae birds mainly eat small insects and lepidopteran larvae, influencing their ecosystems.", "Pepsin is a notable enzyme known for breaking down proteins.", "Lithium peroxide reacts with carbon dioxide to form lithium carbonate.", "By 2008, a significant cryptanalysis of Twofish, a 16-round cipher, was completed using truncated differential cryptanalysis.", "The formula links complex numbers and trigonometry principles.", "Undulators create intense synchrotron radiation multiple times more than bending magnets.", "Many artifacts with sponge-like textures are made of unrelated materials, not from sponges."], "levels": ["A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "B", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C"], "golden_refs": ["This small butterfly triangle - shaped wings .", "Her grandfather loved his steak rare .", "In the United States and Canada , digital clocks and computers usually show 12 a. m. right at midnight .", "He almost died of hunger .", "She is the woman whose research has been published .", "Although I 'm turning twenty today , I still feel like a child .", "The teacher asked him to close the windows .", "Who took the last slice of chocolate cake that I was saving ?", "Do you have any money to contribute to the new program ?", "I wish I could have done it .", "Little is known about his life .", "The class are numbered 7201 - 7440 .", "I wish we could tell them .", "Cashew trees produce cashew nuts .", "This is the room where it all began .", "He died , aged 80 on 23 July , 2014 .", "The band initially planned to record their debut album in the space of two weeks .", "An airplane makes forward thrust when air is pushed in the direction opposite to flight .", "Her smile told me everything I needed to know .", "Kiyoko missed eating rice during her trip .", "I always wanted to be an athlete .", "I have n't seen her since we were in high school together .", "Were there any dresses you wanted to buy ?", "With county codes , official until 1974 .", "The chef had a very big knife .", "There are about 150 plant species on the island , along with 80 types of insects .", "The speech lasted 43 minutes and 2 seconds and had 4931 words .", "I wish they would stop knocking on my door .", "The high prevalence of people from the West on this list may be due to societal attitudes toward homosexuality .", "No birds live in that forest .", "Higher capacity Zip disks must be used in a drive with at least the same capacity ability .", "There have been numerous acts , both groups and individuals , that have won multiple awards .", "Few people succeed in starting their own business and profiting greatly from it .", "It was discovered around 6000 BC that wheat seeds could be crushed between simple millstones to make flour .", "Modern cladistic work has not been conclusive .", "The single most important substance deciding human skin color is the pigment melanin .", "Since the end of the series rumors have circulated that a feature length movie was in the works .", "Recent editions have focused on record feats by person competitors .", "China has officially cited resource depletion and environmental concerns as the reasons for a nationwide crackdown on its rare- earth mineral production sector .", "A winger or wide player refer to a non-defender who plays on the left or right sides of the pitch .", "It has often been noted for its complex lightcurves , which made determination of its shape and rotation somewhat difficult .", "The opinions of viewers at the time was divided The four-part serial aired in 1982 , and it has not done better over time .", "The friction between the ropes and the pulley furnishes the traction which gives this type of lift its name .", "In an extension of his ionic theory Arrhenius proposed definitions for acids and bases , in 1884 .", "He went down the stairs to the first floor cafeteria which had around a hundred people in it .", "The vibrant colors of the coat of arms are to point to a bright future for the islands .", "The clasp on my necklace was broken .", "Not all flowers with multiple ovaries grow into aggregate fruit ; the ovaries of some flowers do not become tightly joined together to make a larger fruit .", "The species in this family vary in size , from 1.5 cm to 12 cm .", "Some performers or groups put on very elaborate and expensive affairs , with parts of the show being similar to a theater performance .", "This changed how dinosaurs are seen by both professional dinosaur illustrators , and by the public .", "The frequency chosen for measuring candelas is in the visible spectrum near green .", "To illustrate the computation , suppose a coach trains long-distance runners for one month using two methods .", "The officials announcing the new policy looked like they were ready for inevitable criticism .", "After soccer practice , my leg suddenly started hurting .", "During the Iron Age humans started using iron for making tools and weapons .", "The eleven municipalities have special status equal to the rayons .", "Their common name comes from the parrots ' strong , monogamous pair bonding and the long time the pairs spend sitting together .", "However , the principle is applied very broadly beyond bottles to paint and automobile parts such as tires .", "The main criticisms were of the two -player mode , a first for the series .", "In 2004 , the firm launched a policy orchestration initiative to integrate patch management , assessment and remediation of remote and mobile computers into its connectivity platform .", "Coagulation begins almost instantly after an injury to the blood vessel has damaged the endothelium lining the vessel .", "He also showed that neither the axiom of choice nor the continuum hypothesis can be disproved from the accepted axioms of set theory , assuming these axioms are consistent .", "Many of the physical properties of alkenes and alkanes are similar : they are colorless , nonpolar , and combustable .", "Completing the square can be used to derive a general formula for solving quadratic equations , called the quadratic formula .", "Histones undergo posttranslational modifications that alter their interaction with DNA and nuclear proteins .", "In the razor shell sexual development is highly synchronous .", "Some people actually consider masturbation as a cardiovascular workout .", "Differential cryptanalysis attacks are usually chosen plaintext attacks , meaning that the attacker must be able to obtain encrypted ciphertexts for some set of plaintexts of his choosing .", "Gerardus't Hooft is well known for his theories about gauge theory , black holes , and quantum gravity .", "All known nudibranchs are carnivorous .", "Researchers studying the opsin genes responsible for color-vision pigments have long known that four photopigment opsins exist in birds , reptiles and teleost fish .", "Ambush predators or sit-and - wait predators are carnivorous animals or other organisms , such as some carnivorous plants .", "In the 12th century the first stone church was built with the formation of the parish Ljungby socken .", "Steppenwolf is an immortal with vast superhuman strength , endurance and speed , capable of lifting about one hundred tons and jumping huge distances easily .", "Heterokont chloroplasts appear to derive from those of red algae , rather than directly from prokaryotes as occurred in plants .", "Knowledge of them comes chiefly from that linguistic reconstruction , along with material evidence from archaeology and archaeogenetics .", "If a sequence converges to some limit , then it is convergent ; otherwise it is divergent .", "Plaintext is used as input to an encryption algorithm ; the output is usually termed ciphertext , particularly when the algorithm is a cipher .", "There are two objects , one convex and one concave , that can both be called regular icosahedra .", "Embryo transfer can be performed after various durations of embryo culture , conferring different stages in embryogenesis .", "Cerebellar ataxia is ataxia that is caused by a problem with a person 's cerebellum .", "Potentially , a white dwarf can generate multiple novae over time as additional hydrogen continues to accrete onto its surface from its companion star .", "The tits are insectivorous , and eat a wide range of small insects and other invertebrates , particularly small leaf-eating caterpillars .", "Pepsin was one of the first enzymes to be discovered , and is polypeptidic in nature .", "Lithium carbonate is generated by combining lithium peroxide with carbon dioxide .", "As of 2008 , the best published cryptanalysis on the Twofish block cipher is a truncated differential cryptanalysis of the full 16 - round version .", "The formula is important because it connects complex numbers and trigonometry .", "Undulators can provide hundreds of time more magnetic flux than a simple bending magnet and as such are in high demand at synchrotron radiation facilities .", "Many objects with sponge- like textures are now made of substances not derived from poriferans ."], "another_version": ["The small butterfly has triangular wing outlines.", "Her grandfather loved rare steak out of habit.", "In the US and Canada, digital clocks show \"12:00 a.m.\" at midnight to mark the start of a new day.", "On the brink of starvation, his resilience was tested by extreme hunger.", "Her research is recognized and published in reputable journals.", "I am 20 yet feel immature and emotionally like a child.", "The instructor asked him to close the windows to stop outsiders from coming in.", "Who took the last chocolate cake slice meant for later?", "Can you contribute funds or resources to this new initiative for socio-political change?", "I regret not acting out of my own will.", "There is scarce known information about his life outcomes.", "This class has a numerical designation from 7201 to 7440.", "I hope we can share all the important outcomes with them.", "Cashew trees grow and produce edible nuts.", "This is where the events started and happened.", "In 2014, he died at 80 years old on July 23rd.", "The band aimed to record their debut album in two weeks, showing intense dedication.", "An airplane pushes air backward to move forward, following Newton's Third Law.", "Her subtle smile meant she understood everything important.", "Kiyoko traveled and missed eating rice, which was out of the ordinary for her.", "I consistently wanted to be athletic and overcome physical limitations through fitness.", "I last saw her when we were both in high school, and it's been a long time with many changes.", "Were there any historically distinctive outfits you wished to own?", "County codes, revised in 1974, show administrative norms and ongoing governance outcomes.", "The renowned chef owned an impressive, formidable knife.", "The island has about 150 plant species and 80 insect species living together.", "The speech lasted 43 minutes and 2 seconds, with 4,931 words.", "I wish the constant knocking stops; it disturbs me and reminds me of less private times.", "Western societies have more people listed here, likely because of long-standing norms that are more accepting of homosexuality.", "This forest, with unique traits, lacks bird habitation due to insufficient nesting and food.", "Zip disks need drives with enough storage to work properly.", "Numerous entities, both groups and individuals, consistently excel and win multiple prestigious awards.", "Few people start successful businesses and make a lot of money.", "Around 6000 BCE, people found out that grinding wheat with stones could make flour.", "Cladistic methods, though rigorous, have not yet conclusively resolved biological classification outcomes.", "Melanin determines skin color complexity.", "Speculation about a movie adaptation has arisen after the series ended, exciting fans.", "Revised editions focus on outstanding outcomes of athletes.", "The Chinese government has issued strict regulations on its rare-earth mineral industry due to resource depletion and environmental concerns.", "A winger is a forward player who mainly plays on the sides of the soccer field.", "Its morphology and rotation are challenging to determine due to its complex lightcurves.", "Viewers' opinions on the 1982 serial remained mixed and did not improve over time.", "The ropes and pulleys create traction and give this lift its name.", "In 1884, Arrhenius defined acids and bases, leading to acid-base chemistry advancements.", "He went down to the dining area with about one hundred people.", "The emblem's colors symbolize a prosperous outcome for the islands.", "My necklace's closure broke, symbolizing the impermanence of things.", "Some flowers with multiple ovaries do not always form aggregate fruits; sometimes, each ovary develops independently.", "This taxonomic family has species ranging from 1.5 to 12 centimeters in size.", "Some performers create lavish, historically inspired productions.", "The paradigm shift changed how dinosaurs are perceived and depicted by illustrators and the public.", "The chosen frequency is close to green light in the visible spectrum.", "A coach trains runners with two teaching methods for a month.", "The dignitaries announced the new policy with determination, expecting criticism and testing their convictions and leadership integrity.", "After practice, my leg suddenly hurt.", "During the Iron Age, humans started using iron to make tools and weapons, changing technology and society.", "Eleven municipalities have administrative status equal to that of rayons.", "These parrots are known as such due to their strong, lifelong pair bonds and close interaction.", "The fundamental principle applies to multiple areas like paint and car parts, not just bottles.", "Objections focused on the first two-player version.", "In 2004, the company started a big plan to make sure all their computer systems work well together.", "When blood vessels get hurt, they start to clot right away.", "He showed proof that, if set theory rules stay the same, we can't prove wrong the axiom of choice or the continuum hypothesis.", "Alkenes and alkanes have similar physical traits. They are hard to see color differences, not attracted to water, and burn easily.", "Completing the square helps find the quadratic formula, a way to solve quadratic equations.", "Histones change when they touch DNA and other proteins, making it hard to understand how genes work.", "Razor shell animals grow and become adults at the same time.", "Some people think masturbation is like exercise.", "Attackers choose plaintexts to find weaknesses in encryption.", "Gerardus't Hooft is a famous scientist who helped us understand things like black holes and quantum gravity.", "Nudibranchs are sea animals that eat meat.", "Scientists study genes for color vision in animals and know there are four types of color pigments.", "Some animals and plants wait for food.", "In the 12th century, a first church was built in Ljungby.", "Steppenwolf is a very strong and fast superhero who can lift heavy things and run fast.", "Heterokonts' chloroplasts come from red algae, not plants.", "We learn about these subjects mostly by rebuilding old languages, finding old things, and studying people's past genes.", "A sequence is convergent if it gets close to a number. If it does not, it is divergent.", "Data gets changed into a secret code by a special math method.", "Two shapes, one with a dome and one with a dome, are called regular icosahedra. Two shapes, one with a dome and one with a dome, are called regular icosahedra. There are two shapes, one with a dome and one", "Embryo transfer happens after different times of growing embryos and includes many parts of embryo development.", "The cerebellum helps control our movements, and problems in it can make our movements uncoordinated.", "A white dwarf can make many new stars over a long time if it keeps getting more hydrogen from a star next to it.", "Birds in the Paridae family like small bugs and often eat caterpillar babies.", "Pepsin is an important enzyme that breaks down proteins.", "Lithium peroxide and carbon dioxide mix to make lithium carbonate.", "In 2008, experts studied the Twofish cipher and found a way to break it in 16 rounds.", "The formula connects complex numbers and trigonometry.", "Undulators make very strong magnetic fields for special machines that need bright light.", "Many things look like sponges but are made of different materials."]}